fast_finish_2026/LR7/webapp/runs/full-2026-09-13T01-50-54-310Z/case_evidence/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
8000
(
200000
200000
200000
200000
200000
200000
200000
200000
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 200000;
    }
    outlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            symmetryPlane;
    }
    wall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
